cfd/Falcon9 OpenFOAM/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    	 inlet	
	{
		type 	fixedValue;
		value	$internalField;
	}
   	
	outlet
	{
		/*
		type 	fixedValue;
		value	$internalField;
		*/
		type zeroGradient;
	}
	
	frontAndBack
	{
		/*
		type 	fixedValue;
		value	$internalField;
		*/
		type zeroGradient;
	}
	
	lowerWall
	{
		/*
		type 	fixedValue;
		value	$internalField;
		*/
		type zeroGradient;
	}
	
	upperWall
	{
		/*
		type 	fixedValue;
		value	$internalField;
		*/
		type zeroGradient;
	}
	falcon9
	{
		/*
		type 	fixedValue;
		value	$internalField;
		*/
		type zeroGradient;
	}
}

// ************************************************************************* //
