cfd/Falcon9 OpenFOAM/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	#include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"
     	inlet
	{
		type            calculated;
        	value           uniform 0;
	}
   	
	outlet
	{
		type            calculated;
        	value           uniform 0;
	}
	
	frontAndBack
	{
		type            calculated;
        	value           uniform 0;
	}
	
	lowerWall
	{
		type            calculated;
        	value           uniform 0;
	}
	
	upperWall
	{
		type            calculated;
        	value           uniform 0;
	}
	falcon9
	{
		type            compressible::alphatWallFunction;
      		Prt             0.85;
        	value           uniform 0;
	}
}


// ************************************************************************* //
