cfd/Falcon9 OpenFOAM/0/mut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	#include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"
     	inlet
	{
		type 	calculated;
		value	uniform 0;
	}
   	
	outlet
	{
		type 	calculated;
		value	uniform 0;
	}
	
	frontAndBack
	{
		type 	calculated;
		value	uniform 0;
	}
	
	lowerWall
	{
		type 	calculated;
		value	uniform 0;
	}
	
	upperWall
	{
		type 	calculated;
		value	uniform 0;
	}
	falcon9
	{	/*
		type 	fixedValue;
		value 	$internalField;
		*/
		type            mutkWallFunction;
     		Cmu             0.09;
       		kappa           0.41;
      		E               9.8;
      		value           uniform 0;
	}
}


// ************************************************************************* //
